ch570512/Qlockwork/src/main.cpp
//=============================================================================
// QLOCKWORK
// @created 12.03.2017
// @mc ESP8266
//
// This source file is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published
// by the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// This source file is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with this program.  If not, see <http://www.gnu.org/licenses/>.
//=============================================================================

#if !defined(ESP8266)
#error This code is designed to run on ESP8266-based boards! Please check your Tools->Board setting.
#endif

#define FIRMWARE_VERSION 20260605

#include <Arduino.h>
#include <ArduinoOTA.h>
#include <DHT.h>
#include <ESP8266WebServer.h>
#include <ESP8266WiFi.h>
#include <WiFiManager.h>
#include <IRremoteESP8266.h>
#include <IRutils.h>
#include <time.h>
#include "Debug.h"
#include "Colors.h"
#include "Configuration.h"
#include "Events.h"
#include "Helpers.h"
#include "LedDriver.h"
#include "MeteoWeather.h"
#include "Modes.h"
#include "Renderer.h"
#include "Settings.h"
#include "WebServer.h"

void buttonModeInterrupt();
void buttonModePressed();
void buttonOnOffInterrupt();
void buttonOnOffPressed();
void buttonTimeInterrupt();
void buttonTimePressed();
void callRoot();
uint8_t getBrightnessFromLDR();
void getRoomConditions();
void handleButtonSettings();
void handleCommitSettings();
void handleControl();
void handleRoot();
void handleSetEvent();
void handleShowText();
void moveScreenBufferUp(uint16_t screenBufferOld[], uint16_t screenBufferNew[], uint8_t color, uint8_t brightness);
void setLedsOff();
void setLedsOn();
void setMode(Mode newMode);
void setupWebServer();
void writeScreenBuffer(uint16_t screenBuffer[], uint8_t color, uint8_t brightness);
void writeScreenBufferFade(uint16_t screenBufferOld[], uint16_t screenBufferNew[], uint8_t color, uint8_t brightness);

//=============================================================================
// Init
//=============================================================================

// HTTP-Server
#ifdef WEBSERVER
ESP8266WebServer webServer(80);
#endif

// DHT22
#ifdef SENSOR_DHT22
DHT dht(PIN_DHT22, DHT22);
#endif

// IR receiver
#ifdef IR_RECEIVER
IRrecv irrecv(PIN_IR_RECEIVER);
decode_results irDecodeResult;
#endif

// LED driver
LedDriver ledDriver;

// Renderer
Renderer renderer;

// Settings
Settings settings;

// Screenbuffer
uint16_t matrix[10] = {};
uint16_t matrixOld[10] = {};
bool screenBufferNeedsUpdate = true;

// Mode
Mode mode = MODE_TIME;
Mode lastMode = mode;
uint32_t modeTimeout = 0;
uint32_t autoModeChangeTimer = AUTO_MODECHANGE_TIME;
bool runTransitionOnce = false;
uint8_t autoMode = 0;

// Time
uint8_t lastDay = 0;
uint8_t lastMinute = 0;
uint8_t lastHour = 0;
uint8_t lastSecond = 0;
uint8_t randomHour = 0;
uint8_t randomMinute = 0;
uint8_t moonphase = 0;
time_t upTime = 0;
const char *dayOfWeek[] = {
    "Sunday", "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday"};
const char *monthOfYear[] = {
    "January", "February", "March", "April", "May", "June",
    "July", "August", "September", "October", "November", "December"};

// Feed
String feedText = "";
uint8_t feedColor = WHITE;
uint8_t feedPosition = 0;

// MeteoWeather
#ifdef WEATHER
MeteoWeather outdoorWeather;
uint8_t errorCounterOutdoorWeather = 0;
#endif

// DHT22
float roomTemperature = 0;
float roomHumidity = 0;
uint8_t errorCounterDHT = 0;

// Brightness and LDR
uint8_t maxBrightness = 0;
uint8_t brightness = 0;
#ifdef LDR
uint8_t iTargetBrightness = 0;
unsigned long iBrightnessMillis = 0;
#endif

// Alarm
#ifdef BUZZER
bool alarmTimerSet = false;
uint8_t alarmTimer = 0;
uint8_t alarmTimerSecond = 0;
uint8_t alarmOn = false;
#endif

// Events
#ifdef EVENT_TIME
uint32_t showEventTimer = EVENT_TIME;
#endif

// Misc
IPAddress myIP = {0, 0, 0, 0};
uint32_t lastButtonPress = 0;
bool testFlag = false;
uint8_t testColumn = 0;
#ifdef DEBUG_FPS
int fps = 0;
#endif

//=============================================================================
// Setup()
//=============================================================================

void setup()
{
    // Init serial port
    Serial.begin(115200);
    delay(1000);

    // And the monkey flips the switch. (Akiva Goldsman)
    DEBUG_SERIAL_PRINTLN(F("*** QLOCKWORK ***"));
    DEBUG_SERIAL_PRINTLN("Firmware: " + String(FIRMWARE_VERSION));
    DEBUG_SERIAL_PRINTLN("Starting on " + String(ARDUINO_BOARD));
    DEBUG_SERIAL_PRINTLN("CPU Frequency = " + String(F_CPU / 1000000) + " MHz");

    // Load settings
    settings.loadFromEEPROM();
    maxBrightness = map(settings.mySettings.brightness, 0, 100, MIN_BRIGHTNESS, MAX_BRIGHTNESS);
    brightness = maxBrightness;

#ifdef POWERON_SELFTEST
    renderer.setAllScreenBuffer(matrix);
    DEBUG_SERIAL_PRINTLN(F("Set all LEDs to red."));
    writeScreenBuffer(matrix, RED, brightness);
    delay(2500);
    DEBUG_SERIAL_PRINTLN(F("Set all LEDs to green."));
    writeScreenBuffer(matrix, GREEN, brightness);
    delay(2500);
    DEBUG_SERIAL_PRINTLN(F("Set all LEDs to blue."));
    writeScreenBuffer(matrix, BLUE, brightness);
    delay(2500);
    DEBUG_SERIAL_PRINTLN(F("Set all LEDs to white."));
    writeScreenBuffer(matrix, WHITE, brightness);
    delay(2500);
#endif

#ifdef ESP_LED
    DEBUG_SERIAL_PRINTLN(F("Setting up ESP-LED"));
    pinMode(PIN_LED, OUTPUT);
    digitalWrite(PIN_LED, HIGH);
#endif

#ifdef MODE_BUTTON
    DEBUG_SERIAL_PRINTLN(F("Setting up Mode-Button."));
    pinMode(PIN_MODE_BUTTON, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(PIN_MODE_BUTTON), buttonModeInterrupt, FALLING);
#endif

#ifdef ONOFF_BUTTON
    DEBUG_SERIAL_PRINTLN(F("Setting up Back-Button."));
    pinMode(PIN_ONOFF_BUTTON, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(PIN_ONOFF_BUTTON), buttonOnOffInterrupt, FALLING);
#endif

#ifdef TIME_BUTTON
    DEBUG_SERIAL_PRINTLN(F("Setting up Time-Button."));
    pinMode(PIN_TIME_BUTTON, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(PIN_TIME_BUTTON), buttonTimeInterrupt, FALLING);
#endif

#ifdef BUZZER
    DEBUG_SERIAL_PRINTLN(F("Setting up Buzzer"));
    pinMode(PIN_BUZZER, OUTPUT);
#endif

#ifdef SENSOR_DHT22
    DEBUG_SERIAL_PRINTLN(F("Setting up DHT22"));
    dht.begin();
#endif

#ifdef LDR
    DEBUG_SERIAL_PRINTLN(F("Setting up LDR."));
    pinMode(PIN_LDR, INPUT);
#endif

#ifdef IR_RECEIVER
    DEBUG_SERIAL_PRINTLN(F("Setting up IR-Receiver"));
    irrecv.enableIRIn();
#endif

    // Start WiFi
    renderer.clearScreenBuffer(matrix);
    renderer.setSmallText("WI", TEXT_POS_TOP, matrix);
    renderer.setSmallText("FI", TEXT_POS_BOTTOM, matrix);
    writeScreenBuffer(matrix, WHITE, brightness);
    WiFiManager wifiManager;
    wifiManager.setConnectTimeout(30);
    wifiManager.setTimeout(120);
    wifiManager.autoConnect(HOSTNAME, WIFI_AP_PASS);
    WiFi.hostname(HOSTNAME);
    WiFi.setAutoConnect(true);
    WiFi.setAutoReconnect(true);
    if (!WiFi.isConnected())
    {
        WiFi.mode(WIFI_AP);
        DEBUG_SERIAL_PRINTLN(F("[ERROR] No WiFi"));
        writeScreenBuffer(matrix, RED, brightness);
        delay(1000);
        if (WiFi.softAP(String(HOSTNAME) + " AP", WIFI_AP_PASS))
        {
            DEBUG_SERIAL_PRINTLN(F("AP started with IP: "));
            myIP = WiFi.softAPIP();
            DEBUG_SERIAL_PRINTLN(myIP);
        }
        else
        {
            DEBUG_SERIAL_PRINTLN("[ERROR] No AP");
        }
    }
    else
    {
        WiFi.mode(WIFI_STA);
        DEBUG_SERIAL_PRINTLN("Hostname: " + String(HOSTNAME));
        DEBUG_SERIAL_PRINTLN("RSSI: " + String(WiFi.RSSI()));
        writeScreenBuffer(matrix, GREEN, brightness);
        delay(1000);
        myIP = WiFi.localIP();

        // Configure NTP-Client
        configTime(NTP_TIMEZONE, NTP_SERVER);
        DEBUG_SERIAL_PRINTLN("NTP Server: " + String(NTP_SERVER));
        DEBUG_SERIAL_PRINTLN("NTP Timezone: " + String(NTP_TIMEZONE));
        time_t now_time_t = time(nullptr);
        while (now_time_t < 8 * 3600 * 2)
        {
            delay(500);
            now_time_t = time(nullptr);
            DEBUG_SERIAL_PRINTLN(".");
        }

#ifdef ARDUINO_OTA
        DEBUG_SERIAL_PRINTLN(F("Starting OTA"));
        ArduinoOTA.begin();
#endif

        // Get weather from MeteoWeather
#ifdef WEATHER
        !outdoorWeather.getOutdoorConditions(LATITUDE, LONGITUDE, TIMEZONE) ? errorCounterOutdoorWeather++ : errorCounterOutdoorWeather = 0;
#endif
    }

#ifdef WEBSERVER
    DEBUG_SERIAL_PRINTLN(F("Starting webserver"));
    setupWebServer();
#endif

#ifdef SHOW_IP
    // WiFi.isConnected() ? feedText = "  IP: " : feedText = "  AP-IP: ";
    feedText = "  IP: ";
    feedText += String(myIP[0]) + "." + String(myIP[1]) + "." + String(myIP[2]) + "." + String(myIP[3]) + "   ";
    feedPosition = 0;
    feedColor = WHITE;
    mode = MODE_FEED;
#endif

    renderer.clearScreenBuffer(matrix);

    // Define a random time
    randomSeed(analogRead(A0));
    randomHour = random(0, 24);
    randomMinute = random(5, 56);

    // Print some infos
#ifdef DEBUG
#ifdef EVENT_TIME
    Serial.printf("Events: %u\n", sizeof(events) / sizeof(event_t) - 1);
#endif
    Serial.printf("Day on: %02u:%02u\n", getHour(settings.mySettings.dayOnTime), getMinute(settings.mySettings.dayOnTime));
    Serial.printf("Night off: %02u:%02u\n", getHour(settings.mySettings.nightOffTime), getMinute(settings.mySettings.nightOffTime));
    Serial.printf("Alarm1: %02u:%02u\n", getHour(settings.mySettings.alarm1Time), getMinute(settings.mySettings.alarm1Time));
    settings.mySettings.alarm1 ? Serial.print("on ") : Serial.print("off ");
    Serial.println(settings.mySettings.alarm1Weekdays, BIN);
    Serial.printf("Alarm2: %02u:%02u\n", getHour(settings.mySettings.alarm2Time), getMinute(settings.mySettings.alarm2Time));
    settings.mySettings.alarm2 ? Serial.print("on ") : Serial.print("off ");
    Serial.println(settings.mySettings.alarm2Weekdays, BIN);
    Serial.printf("Random time: %02u:%02u\n", randomHour, randomMinute);
    Serial.println(F("DEBUG enabled"));
#else
    Serial.println(F("DEBUG disabled"));
#endif

#ifdef FRONTCOVER_BINARY
    settings.mySettings.transition = TRANSITION_NORMAL;
#endif
}

