ch570512/Qlockwork/src/main.cpp
        // Flash ESP LED
#ifdef ESP_LED
        digitalWrite(PIN_LED, !digitalRead(PIN_LED));
#endif

        // Countdown timeralarm by one minute in the second it was activated
#ifdef BUZZER
        if (alarmTimer && alarmTimerSet && (alarmTimerSecond == tmNow.tm_sec))
        {
            alarmTimer--;
#ifdef DEBUG
            if (alarmTimer)
            {
                Serial.printf("Timeralarm in %u min.\n", alarmTimer);
            }
#endif
        }
        // Switch on buzzer for timer
        if (!alarmTimer && alarmTimerSet)
        {
            alarmTimerSet = false;
            alarmOn = BUZZTIME_TIMER;
            DEBUG_SERIAL_PRINTLN(F("Timeralarm: on"));
        }
#endif

        // Auto switch modes
        if (settings.mySettings.modeChange && (mode == MODE_TIME))
        {
            autoModeChangeTimer--;
            if (!autoModeChangeTimer)
            {
                DEBUG_SERIAL_PRINTLN(F("Auto modechange (") + String(autoMode) + F(")"));
                autoModeChangeTimer = AUTO_MODECHANGE_TIME;
                switch (autoMode)
                {
                case 0:
#ifdef WEATHER
                    if (WiFi.isConnected())
                    {
                        setMode(MODE_EXT_TEMP);
                    }
                    else
                    {
                        WiFi.reconnect();
                        setMode(MODE_EXT_TEMP);
                    }
#endif
                    autoMode = 1;
                    break;
                case 1:
#if defined(SENSOR_DHT22)
                    setMode(MODE_TEMP);
#else
#ifdef WEATHER
                    if (WiFi.isConnected())
                    {
                        setMode(MODE_EXT_TEMP);
                    }
                    else
                    {
                        WiFi.reconnect();
                        setMode(MODE_EXT_TEMP);
                    }
#endif
#endif
                    autoMode = 0;
                    break;
                }
            }
        }

        // Show event in feed
#ifdef EVENT_TIME
        if (mode == MODE_TIME)
        {
            showEventTimer--;
            if (!showEventTimer)
            {
                showEventTimer = EVENT_TIME;
                for (uint8_t i = 0; i < (sizeof(events) / sizeof(event_t)); i++)
                {
                    if ((tmNow.tm_mday == events[i].day) && (tmNow.tm_mon == events[i].month))
                    {
                        if (events[i].year)
                        {
                            feedText = "  " + events[i].text + " (" + String(tmNow.tm_year - events[i].year) + ")   ";
                        }
                        else
                        {
                            feedText = "  " + events[i].text + "   ";
                        }
                        feedPosition = 0;
                        feedColor = events[i].color;
                        DEBUG_SERIAL_PRINTLN("Event: \"" + feedText + "\"");
                        setMode(MODE_FEED);
                    }
                }
            }
        }
#endif
    }

    //=============================================================================
    // Run always
    //=============================================================================

    // Make sure the textfeed is updated
    if (mode == MODE_FEED)
        screenBufferNeedsUpdate = true;

    // Set brightness from LDR and update display at 25Hz
#ifdef LDR
    if (settings.mySettings.useAbc)
    {
        if ((millis() - iBrightnessMillis >= 40) && !testFlag)
        {
            iBrightnessMillis = millis();
            iTargetBrightness = getBrightnessFromLDR();
            if (brightness < iTargetBrightness)
            {
                brightness++;
                writeScreenBuffer(matrix, settings.mySettings.color, brightness);
            }
            if (brightness > iTargetBrightness)
            {
                brightness--;
                writeScreenBuffer(matrix, settings.mySettings.color, brightness);
            }
        }
    }
#endif

    // Watch out for IR commands and handle them accordingly
#ifdef IR_RECEIVER
    if (irrecv.decode(&irDecodeResult))
    {
#ifdef DEBUG_IR
        Serial.print(F("IR signal: 0x"));
        serialPrintUint64(irDecodeResult.value, HEX);
        Serial.println();
#endif
        switch (irDecodeResult.value)
        {
        case IR_CODE_ONOFF:
            buttonOnOffPressed();
            break;
        case IR_CODE_TIME:
            buttonTimePressed();
            break;
        case IR_CODE_MODE:
            buttonModePressed();
            break;
        }
        irrecv.resume();
    }
#endif

    // Render a new screenbuffer if needed
    if (screenBufferNeedsUpdate)
    {
        screenBufferNeedsUpdate = false;

        // Save old screenbuffer (or not if it's the test pattern)
        if (testFlag)
        {
            for (uint8_t i = 0; i <= 9; i++)
            {
                matrixOld[i] = 0;
            }
            testFlag = false;
        }
        else
            for (uint8_t i = 0; i <= 9; i++)
            {
                matrixOld[i] = matrix[i];
            }

        switch (mode)
        {
        case MODE_TIME:
            renderer.clearScreenBuffer(matrix);

#ifdef FRONTCOVER_BINARY
            matrix[0] = 0b1111000000000000;
            matrix[1] = tmNow.tm_hour << 5;
            matrix[2] = tmNow.tm_min << 5;
            matrix[3] = tmNow.tm_sec << 5;
            matrix[5] = 0b1111000000000000;
            matrix[6] = tmNow.tm_mday << 5;
            matrix[7] = tmNow.tm_mon + 1 << 5;
            matrix[8] = tmNow.tm_year + 1900 << 5;
#else
            renderer.setTime(tmNow.tm_hour, tmNow.tm_min, matrix);
            renderer.setCorners(tmNow.tm_min, matrix);
            if (!settings.mySettings.itIs && ((tmNow.tm_min / 5) % 6))
                renderer.clearEntryWords(matrix);
#endif
#ifdef BUZZER
            if (settings.mySettings.alarm1 || settings.mySettings.alarm2 || alarmTimerSet)
                renderer.setAlarmLed(matrix);
#endif
            break;

