ch570512/Qlockwork/src/main.cpp
#ifdef SHOW_MODE_AMPM
        case MODE_AMPM:
            renderer.clearScreenBuffer(matrix);
            tmNow.tm_hour < 12 ? renderer.setSmallText("AM", TEXT_POS_MIDDLE, matrix) : renderer.setSmallText("PM", TEXT_POS_MIDDLE, matrix);
            break;
#endif

#ifdef SHOW_MODE_SECONDS
        case MODE_SECONDS:
            renderer.clearScreenBuffer(matrix);
            renderer.setCorners(tmNow.tm_min, matrix);
            for (uint8_t i = 0; i <= 6; i++)
            {
                matrix[1 + i] |= numbersBig[tmNow.tm_sec / 10][i] << 11;
                matrix[1 + i] |= numbersBig[tmNow.tm_sec % 10][i] << 5;
            }
            break;
#endif

#ifdef SHOW_MODE_WEEKDAY
        case MODE_WEEKDAY:
            renderer.clearScreenBuffer(matrix);
            renderer.setSmallText(String(sWeekday[tmNow.tm_wday][0]) + String(sWeekday[tmNow.tm_wday][1]), TEXT_POS_MIDDLE, matrix);
            break;
#endif

#ifdef SHOW_MODE_DATE
        case MODE_DATE:
            renderer.clearScreenBuffer(matrix);

            // Create buffers to hold the formatted strings (max 3 chars: "01")
            char dayBuf[4];
            char monBuf[4];

            // Use snprintf for safe, heap-free formatting
            // %02d means: integer, at least 2 digits wide, pad with '0'
            snprintf(dayBuf, sizeof(dayBuf), "%02d", (uint8_t)tmNow.tm_mday);
            snprintf(monBuf, sizeof(monBuf), "%02d", (uint8_t)tmNow.tm_mon + 1);

            // Render the pre-formatted strings
            renderer.setSmallText(dayBuf, TEXT_POS_TOP, matrix);
            renderer.setSmallText(monBuf, TEXT_POS_BOTTOM, matrix);

            // Manual pixel overrides
            renderer.setPixelInScreenBuffer(5, 4, matrix);
            renderer.setPixelInScreenBuffer(5, 9, matrix);
            break;

#endif

#ifdef SHOW_MODE_MOONPHASE
        case MODE_MOONPHASE:
            renderer.clearScreenBuffer(matrix);
            switch (moonphase)
            {
            case 0:
                matrix[0] = 0b0000111000000000;
                matrix[1] = 0b0011000110000000;
                matrix[2] = 0b0100000001000000;
                matrix[3] = 0b0100000001000000;
                matrix[4] = 0b1000000000100000;
                matrix[5] = 0b1000000000100000;
                matrix[6] = 0b0100000001000000;
                matrix[7] = 0b0100000001000000;
                matrix[8] = 0b0011000110000000;
                matrix[9] = 0b0000111000000000;
                break;
            case 1:
                matrix[0] = 0b0000111000000000;
                matrix[1] = 0b0000001110000000;
                matrix[2] = 0b0000000111000000;
                matrix[3] = 0b0000000111000000;
                matrix[4] = 0b0000000111100000;
                matrix[5] = 0b0000000111100000;
                matrix[6] = 0b0000000111000000;
                matrix[7] = 0b0000000111000000;
                matrix[8] = 0b0000001110000000;
                matrix[9] = 0b0000111000000000;
                break;
            case 2:
                matrix[0] = 0b0000011000000000;
                matrix[1] = 0b0000011110000000;
                matrix[2] = 0b0000011111000000;
                matrix[3] = 0b0000011111000000;
                matrix[4] = 0b0000011111100000;
                matrix[5] = 0b0000011111100000;
                matrix[6] = 0b0000011111000000;
                matrix[7] = 0b0000011111000000;
                matrix[8] = 0b0000011110000000;
                matrix[9] = 0b0000011000000000;
                break;
            case 3:
                matrix[0] = 0b0000111000000000;
                matrix[1] = 0b0001111110000000;
                matrix[2] = 0b0001111111000000;
                matrix[3] = 0b0001111111000000;
                matrix[4] = 0b0001111111100000;
                matrix[5] = 0b0001111111100000;
                matrix[6] = 0b0001111111000000;
                matrix[7] = 0b0001111111000000;
                matrix[8] = 0b0001111110000000;
                matrix[9] = 0b0000111000000000;
                break;
            case 4:
                matrix[0] = 0b0000111000000000;
                matrix[1] = 0b0011111110000000;
                matrix[2] = 0b0111111111000000;
                matrix[3] = 0b0111111111000000;
                matrix[4] = 0b1111111111100000;
                matrix[5] = 0b1111111111100000;
                matrix[6] = 0b0111111111000000;
                matrix[7] = 0b0111111111000000;
                matrix[8] = 0b0011111110000000;
                matrix[9] = 0b0000111000000000;
                break;
            case 5:
                matrix[0] = 0b0000111000000000;
                matrix[1] = 0b0011111100000000;
                matrix[2] = 0b0111111100000000;
                matrix[3] = 0b0111111100000000;
                matrix[4] = 0b1111111100000000;
                matrix[5] = 0b1111111100000000;
                matrix[6] = 0b0111111100000000;
                matrix[7] = 0b0111111100000000;
                matrix[8] = 0b0011111100000000;
                matrix[9] = 0b0000111000000000;
                break;
            case 6:
                matrix[0] = 0b0000110000000000;
                matrix[1] = 0b0011110000000000;
                matrix[2] = 0b0111110000000000;
                matrix[3] = 0b0111110000000000;
                matrix[4] = 0b1111110000000000;
                matrix[5] = 0b1111110000000000;
                matrix[6] = 0b0111110000000000;
                matrix[7] = 0b0111110000000000;
                matrix[8] = 0b0011110000000000;
                matrix[9] = 0b0000110000000000;
                break;
            case 7:
                matrix[0] = 0b0000111000000000;
                matrix[1] = 0b0011100000000000;
                matrix[2] = 0b0111000000000000;
                matrix[3] = 0b0111000000000000;
                matrix[4] = 0b1111000000000000;
                matrix[5] = 0b1111000000000000;
                matrix[6] = 0b0111000000000000;
                matrix[7] = 0b0111000000000000;
                matrix[8] = 0b0011100000000000;
                matrix[9] = 0b0000111000000000;
                break;
            }
            break;
#endif

#ifdef SENSOR_DHT22
        case MODE_TEMP:
            DEBUG_SERIAL_PRINTLN(F("Room Temperature: ") + String(roomTemperature) + F(" °C"));
            renderer.clearScreenBuffer(matrix);
            if (roomTemperature == 0)
            {
                matrix[0] = 0b0000000001000000;
                matrix[1] = 0b0000000010100000;
                matrix[2] = 0b0000000010100000;
                matrix[3] = 0b0000000011100000;
            }
            if (roomTemperature > 0)
            {
                matrix[0] = 0b0000000001000000;
                matrix[1] = 0b0100000010100000;
                matrix[2] = 0b1110000010100000;
                matrix[3] = 0b0100000011100000;
            }
            if (roomTemperature < 0)
            {
                matrix[0] = 0b0000000001000000;
                matrix[1] = 0b0000000010100000;
                matrix[2] = 0b1110000010100000;
                matrix[3] = 0b0000000011100000;
            }
            renderer.setSmallText(String(int(abs(roomTemperature) + 0.5)), TEXT_POS_BOTTOM, matrix);
            break;

        case MODE_HUMIDITY:
            DEBUG_SERIAL_PRINTLN(F("Room Humidity: ") + String(roomHumidity) + F(" %rH"));
            renderer.clearScreenBuffer(matrix);
            renderer.setSmallText(String(int(roomHumidity + 0.5)), TEXT_POS_TOP, matrix);
            matrix[6] = 0b0100100001000000;
            matrix[7] = 0b0001000010100000;
            matrix[8] = 0b0010000010100000;
            matrix[9] = 0b0100100011100000;
            break;
#endif

#ifdef WEATHER
        case MODE_EXT_TEMP:
            DEBUG_SERIAL_PRINTLN(F("Outdoor temperature: ") + String(outdoorWeather.temperature) + F(" °C"));
            renderer.clearScreenBuffer(matrix);
            if (outdoorWeather.temperature > 0)
            {
                matrix[1] = 0b0100000000000000;
                matrix[2] = 0b1110000000000000;
                matrix[3] = 0b0100000000000000;
            }
            if (outdoorWeather.temperature < 0)
                matrix[2] = 0b1110000000000000;
            renderer.setSmallText(String(int(abs(outdoorWeather.temperature) + 0.5)), TEXT_POS_BOTTOM, matrix);
            break;
        case MODE_EXT_HUMIDITY:
            DEBUG_SERIAL_PRINTLN(F("Outdoor humidity: ") + String(outdoorWeather.humidity) + F(" %rH"));
            renderer.clearScreenBuffer(matrix);
            if (outdoorWeather.humidity < 100)
                renderer.setSmallText(String(outdoorWeather.humidity), TEXT_POS_TOP, matrix);
            else
            {
                matrix[0] = 0b0010111011100000;
                matrix[1] = 0b0110101010100000;
                matrix[2] = 0b0010101010100000;
                matrix[3] = 0b0010101010100000;
                matrix[4] = 0b0010111011100000;
            }
            matrix[6] = 0b0100100000000000;
            matrix[7] = 0b0001000000000000;
            matrix[8] = 0b0010000000000000;
            matrix[9] = 0b0100100000000000;
            break;
#endif

#ifdef BUZZER
        case MODE_TIMER:
            renderer.clearScreenBuffer(matrix);
            renderer.setSmallText("TI", TEXT_POS_TOP, matrix);
            renderer.setSmallText(String(alarmTimer), TEXT_POS_BOTTOM, matrix);
            break;
#endif

#ifdef SHOW_MODE_TEST
        case MODE_TEST:
            renderer.clearScreenBuffer(matrix);
            if (testColumn == 10)
                testColumn = 0;
            matrix[testColumn] = 0b1111111111110000;
            testColumn++;
            break;
        case MODE_RED:
        case MODE_GREEN:
        case MODE_BLUE:
        case MODE_WHITE:
            renderer.setAllScreenBuffer(matrix);
            testFlag = true;
            break;
#endif

        case MODE_COUNT:
        {
        }

