ch570512/Qlockwork/src/main.cpp
        case MODE_BLANK:
            renderer.clearScreenBuffer(matrix);
            break;

        case MODE_FEED:
            for (uint8_t y = 0; y <= 5; y++)
            {
                renderer.clearScreenBuffer(matrix);
                for (uint8_t z = 0; z <= 6; z++)
                {
                    matrix[2 + z] |= (lettersBig[feedText[feedPosition] - 32][z] << (11 + y)) & 0b1111111111100000;
                    matrix[2 + z] |= (lettersBig[feedText[feedPosition + 1] - 32][z] << (5 + y)) & 0b1111111111100000;
                    matrix[2 + z] |= (lettersBig[feedText[feedPosition + 2] - 32][z] << (y - 1)) & 0b1111111111100000;
                }
                writeScreenBuffer(matrix, feedColor, brightness);
                delay(120);
            }
            feedPosition++;
            if (feedPosition == feedText.length() - 2)
            {
                feedPosition = 0;
                setMode(MODE_TIME);
            }
            break;
        }

        // turn off LED behind IR-sensor
#ifdef IR_LETTER_OFF
        renderer.unsetPixelInScreenBuffer(IR_LETTER_X, IR_LETTER_Y - 1, matrix);
#endif

#ifdef DEBUG_MATRIX
        // debugScreenBuffer(matrixOld);
        debugScreenBuffer(matrix);
#endif

#ifdef DEBUG
        struct tm tmNow = getTime();
        Serial.printf("Time (ESP): %02d:%02d:%02d %s, %s %02d. %02d \n", tmNow.tm_hour, tmNow.tm_min, tmNow.tm_sec, dayOfWeek[tmNow.tm_wday], monthOfYear[tmNow.tm_mon], tmNow.tm_mday, tmNow.tm_year + 1900);
        DEBUG_SERIAL_PRINTLN(F("Total Free Heap: ") + String(ESP.getFreeHeap() / 1024.0f) + F(" kB"));
#endif

        // write screenbuffer to display
        switch (mode)
        {
        case MODE_TIME:
        case MODE_BLANK:
            if (settings.mySettings.transition == TRANSITION_NORMAL)
                writeScreenBuffer(matrix, settings.mySettings.color, brightness);
            if (settings.mySettings.transition == TRANSITION_FADE)
                writeScreenBufferFade(matrixOld, matrix, settings.mySettings.color, brightness);
            if (settings.mySettings.transition == TRANSITION_MOVEUP)
            {
                if (tmNow.tm_min % 5 == 0)
                    moveScreenBufferUp(matrixOld, matrix, settings.mySettings.color, brightness);
                else
                    writeScreenBuffer(matrix, settings.mySettings.color, brightness);
            }
            break;
#ifdef SHOW_MODE_TEST
        case MODE_RED:
            writeScreenBuffer(matrix, RED, brightness);
            break;
        case MODE_GREEN:
            writeScreenBuffer(matrix, GREEN, brightness);
            break;
        case MODE_BLUE:
            writeScreenBuffer(matrix, BLUE, brightness);
            break;
        case MODE_WHITE:
            writeScreenBuffer(matrix, WHITE, brightness);
            break;
#endif
        case MODE_FEED:
            writeScreenBuffer(matrix, feedColor, brightness);
            break;
        default:
            if (runTransitionOnce)
            {
                // if (settings.mySettings.transition == TRANSITION_NORMAL)
                //     writeScreenBuffer(matrix, settings.mySettings.color, brightness);
                // if (settings.mySettings.transition == TRANSITION_FADE)
                //     writeScreenBufferFade(matrixOld, matrix, settings.mySettings.color, brightness);
                // if (settings.mySettings.transition == TRANSITION_MOVEUP)
                //     moveScreenBufferUp(matrixOld, matrix, settings.mySettings.color, brightness);
                moveScreenBufferUp(matrixOld, matrix, settings.mySettings.color, brightness);
                runTransitionOnce = false;
                testColumn = 0;
            }
            else
                writeScreenBuffer(matrix, settings.mySettings.color, brightness);
            break;
        }
    }

    // Wait for mode timeout then switch back to time
    if ((millis() > (modeTimeout + settings.mySettings.timeout * 1000)) && modeTimeout)
    {
        setMode(MODE_TIME);
    }

#ifdef DEBUG_FPS
    // debugFps();
    fps++;
#endif
}

//=============================================================================
// Transitions
//=============================================================================

void writeScreenBuffer(uint16_t screenBuffer[], uint8_t color, uint8_t brightness)
{
    ledDriver.clear();
    for (uint8_t y = 0; y <= 9; y++)
    {
        for (uint8_t x = 0; x <= 10; x++)
        {
            if (bitRead(screenBuffer[y], 15 - x))
            {
                ledDriver.setPixel(x, y, color, brightness);
            }
        }
    }

    // Corner LEDs
    for (uint8_t y = 0; y <= 3; y++)
    {
        if (bitRead(screenBuffer[y], 4))
        {
            ledDriver.setPixel(110 + y, color, brightness);
        }
    }

    // Alarm LED
#ifdef BUZZER
    if (bitRead(screenBuffer[4], 4))
    {
#ifdef ALARM_LED_COLOR
#ifdef ABUSE_CORNER_LED_FOR_ALARM
        if (settings.mySettings.alarm1 || settings.mySettings.alarm2 || alarmTimerSet)
        {
            ledDriver.setPixel(111, ALARM_LED_COLOR, brightness);
        }
        else if (bitRead(screenBuffer[1], 4))
        {
            ledDriver.setPixel(111, color, brightness);
        }
#else
        ledDriver.setPixel(114, ALARM_LED_COLOR, brightness);
#endif
#else
        ledDriver.setPixel(114, color, brightness);
#endif
    }
#endif

    ledDriver.show();
}

void moveScreenBufferUp(uint16_t screenBufferOld[], uint16_t screenBufferNew[], uint8_t color, uint8_t brightness)
{
    for (uint8_t z = 0; z <= 9; z++)
    {
        for (uint8_t i = 0; i <= 8; i++)
        {
            screenBufferOld[i] = screenBufferOld[i + 1];
        }
        screenBufferOld[9] = screenBufferNew[z];
        writeScreenBuffer(screenBufferOld, color, brightness);
        delay(50);
    }
}

void writeScreenBufferFade(uint16_t screenBufferOld[], uint16_t screenBufferNew[], uint8_t color, uint8_t brightness)
{
    ledDriver.clear();
    uint8_t brightnessBuffer[10][12] = {};

    // Copy old matrix to buffer
    for (uint8_t y = 0; y <= 9; y++)
    {
        for (uint8_t x = 0; x <= 11; x++)
        {
            if (bitRead(screenBufferOld[y], 15 - x))
            {
                brightnessBuffer[y][x] = brightness;
            }
        }
    }

