ch570512/Qlockwork/src/main.cpp
//=============================================================================
// Misc
//=============================================================================

// Switch off LEDs
void setLedsOff()
{
    DEBUG_SERIAL_PRINTLN(F("LEDs: off"));
    setMode(MODE_BLANK);
}

// Switch on LEDs
void setLedsOn()
{
    DEBUG_SERIAL_PRINTLN(F("LEDs: on"));
    setMode(lastMode);
}

//=============================================================================
// Webserver
//=============================================================================

#ifdef WEBSERVER
void setupWebServer()
{
    webServer.onNotFound([]()
                         { handleNotFound(webServer); });
    webServer.on("/", handleRoot);
    webServer.on("/handleButtonOnOff", []()
                 { buttonOnOffPressed(); callRoot(); });
    webServer.on("/handleButtonSettings", handleButtonSettings);
    webServer.on("/handleButtonMode", []()
                 { buttonModePressed(); callRoot(); });
    webServer.on("/handleButtonTime", []()
                 { buttonTimePressed(); callRoot(); });
    webServer.on("/commitSettings", handleCommitSettings);
    webServer.on("/reset", []()
                 { handleReset(webServer); });
    webServer.on("/setEvent", handleSetEvent);
    webServer.on("/showText", handleShowText);
    webServer.on("/control", handleControl);
    webServer.begin();
}

void callRoot()
{
    webServer.send(200, "text/html", "<!doctype html><html><head><script>window.onload=function(){window.location.replace('/');}</script></head></html>");
}

// Page /
void handleRoot()
{
    String message = "<!doctype html>"
                     "<html>"
                     "<head>"
                     "<title>" +
                     String(WEBSITE_TITLE) +
                     "</title>"
                     "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\">"
                     "<meta http-equiv=\"refresh\" content=\"60\" charset=\"UTF-8\">"
                     "<link rel=\"stylesheet\" href=\"https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css\">"
                     "<style>"
                     "body{background-color:#FFFFFF;text-align:center;color:#333333;font-family:Sans-serif;font-size:16px;}"
                     "button{background-color:#1FA3EC;text-align:center;color:#FFFFFF;width:200px;padding:10px;border:5px solid #FFFFFF;font-size:24px;border-radius:10px;}"
                     "</style>"
                     "</head>"
                     "<body>"
                     "<h1>" +
                     String(WEBSITE_TITLE) +
                     "</h1>";
#ifdef DEDICATION
    message += DEDICATION;
    message += "<br><br>";
#endif
    if (mode == MODE_BLANK)
        message += "<button title=\"Switch LEDs on\" onclick=\"window.location.href='/handleButtonOnOff'\"><i class=\"fa fa-toggle-off\"></i></button>";
    else
        message += "<button title=\"Switch LEDs off\" onclick=\"window.location.href='/handleButtonOnOff'\"><i class=\"fa fa-toggle-on\"></i></button>";
    message += "<button title=\"Settings\" onclick=\"window.location.href='/handleButtonSettings'\"><i class=\"fa fa-gear\"></i></button>"
               "<br><br>"
               "<button title=\"Switch modes\" onclick=\"window.location.href='/handleButtonMode'\"><i class=\"fa fa-bars\"></i></button>"
               "<button title=\"Return to time\" onclick=\"window.location.href='/handleButtonTime'\"><i class=\"fa fa-clock-o\"></i></button>";
#ifdef SENSOR_DHT22
    message += "<br><br><i class = \"fa fa-home\" style=\"font-size:20px;\"></i>";
    message += "<br><i class=\"fa fa-thermometer\" style=\"font-size:20px;\"></i> " + String(roomTemperature) + " &deg;C / " + String(roomTemperature * 1.8 + 32.0) + " &deg;F";
    message += "<br><i class=\"fa fa-tint\" style=\"font-size:20px;\"></i> " + String(roomHumidity) + " %rH"
                                                                                                      "<br><span style=\"font-size:20px;\">";
    if (roomHumidity < 30)
        message += "<i style=\"color:Red;\" class=\"fa fa-square\"\"></i>";
    else
        message += "<i style=\"color:Red;\" class=\"fa fa-square-o\"></i>";
    if ((roomHumidity >= 30) && (roomHumidity < 40))
        message += "&nbsp;<i style=\"color:Orange;\" class=\"fa fa-square\"></i>";
    else
        message += "&nbsp;<i style=\"color:Orange;\" class=\"fa fa-square-o\"></i>";
    if ((roomHumidity >= 40) && (roomHumidity <= 50))
        message += "&nbsp;<i style=\"color:MediumSeaGreen;\" class=\"fa fa-square\"></i>";
    else
        message += "&nbsp;<i style=\"color:MediumSeaGreen;\" class=\"fa fa-square-o\"></i>";
    if ((roomHumidity > 50) && (roomHumidity < 60))
        message += "&nbsp;<i style=\"color:Lightblue;\" class=\"fa fa-square\"></i>";
    else
        message += "&nbsp;<i style=\"color:Lightblue;\" class=\"fa fa-square-o\"></i>";
    if (roomHumidity >= 60)
        message += "&nbsp;<i style=\"color:Blue;\" class=\"fa fa-square\"></i>";
    else
        message += "&nbsp;<i style=\"color:Blue;\" class=\"fa fa-square-o\"></i>";
    message += "</span>";
#endif
#ifdef WEATHER
    message += "<br><br><i class = \"fa fa-tree\" style=\"font-size:20px;\"></i>"
               "<br><i class = \"fa fa-thermometer\" style=\"font-size:20px;\"></i> " +
               String(outdoorWeather.temperature) + " &deg;C / " + String(outdoorWeather.temperature * 1.8 + 32.0) + " &deg;F" +
               "<br><i class = \"fa fa-tint\" style=\"font-size:20px;\"></i> " + String(outdoorWeather.humidity) + " %rH" +
               "<br>" + String(outdoorWeather.pressure) + " hPa / " + String(outdoorWeather.pressure / 33.865) + " inHg";

    struct tm *sunriseTime = localtime(&outdoorWeather.sunrise);
    message += "<br><i class = \"fa fa-sun-o\" style=\"font-size:20px;\"></i> " + String(sunriseTime->tm_hour) + ":" + String(sunriseTime->tm_min);

    struct tm *sunsetTime = localtime(&outdoorWeather.sunset);
    message += " <i class = \"fa fa-moon-o\" style=\"font-size:20px;\"></i> " + String(sunsetTime->tm_hour) + ":" + String(sunsetTime->tm_min);
#endif
    message += "<span style=\"font-size:12px;\">"
               "<br><br><a href=\"https://github.com/ch570512/Qlockwork\">Qlockwork</a> was <i class=\"fa fa-code\"></i> with <i class=\"fa fa-heart\"></i> by ch570512"
               "<br>Firmware: " +
               String(FIRMWARE_VERSION);
#ifdef DEBUG_WEB
    struct tm tmNow = getTime();
    char timeBuffer[20];
    snprintf(timeBuffer, sizeof(timeBuffer), "<br><br>Time: %02d:%02d",
             tmNow.tm_hour, tmNow.tm_min);
    message += String(timeBuffer);

